<?php

/**
 * Абстрактний класс AdminBase містить загальну логіку для контроллерів, які 
 * використовуються у панелі адміністратора
 */
abstract class AdminBase
{

    /**
     * метод, який перевіряє користувача на то, чи є він адміністратором
     * @return boolean
     */
    public static function checkAdmin()
    {
        // перевіряємо чи користувач пройшов авторизацію. Якщо ні, перенаправляємо його
        $userId = User::checkLogged();
        
        // получаємо інформацію про користувача (поточного)
        $user = User::getUserById($userId);

        // якщо роль поточного користувача "admin", пускаємо його до адмінпанелі
        if ($user['role'] == 'admin') {
            return true;
        }

        // завершуємо роботу з повідомленням про закритий доступ
        die('Access denied');
    }

}
